## Checking for Missing Values Using isnull() and notnull()

### 1.1. Creating Data

In [1]:
import pandas as pd

data = pd.DataFrame([['Rama', 26, None],['Suresh', 25, 'GDP'],['vj', None, 'GDP']],
                   columns=['Name', 'Age', 'Addr'])

display(data)

     Name   Age  Addr
0    Rama  26.0  None
1  Suresh  25.0   GDP
2      vj   NaN   GDP

### 1.2. Checking Null Values:
> Go through this link for more understandability:

In [2]:
import pandas as pd

# Checking whether the total data set has null values or not
print("isnull result of DataFrame:")
display(data.isna())

# Checking whether a single column has null values or not
print(f"isnull result of Series: \n\n{data['Addr'].isnull()}")

###############SECOND WAY################

# Checking whether the total data set has null values or not
print("notnull result of DataFrame:")
display(data.notna())

# Checking whether a single column has null values or not
print(f"notnull result of Series: \n\n{data['Addr'].notnull()}")

isnull result of DataFrame:

    Name    Age   Addr
0  False  False   True
1  False  False  False
2  False   True  False

isnull result of Series:

0     True
1    False
2    False
Name: Addr, dtype: bool
notnull result of DataFrame:

   Name    Age   Addr
0  True   True  False
1  True   True   True
2  True  False   True

notnull result of Series:

0    False
1     True
2     True
Name: Addr, dtype: bool

## 2. Filling Null Values

In [4]:
# Fill null values with a specific value (0)
df = data.fillna(0)
display(df)

     Name   Age Addr
0    Rama  26.0    0
1  Suresh  25.0  GDP
2      vj   0.0  GDP

In [5]:
# Fill null values with previous value.
## Note: It can’t fill null value if first value is null in a column. Because first values don’t have previous value.   
df = data.fillna(method='pad')
display(df)

     Name   Age  Addr
0    Rama  26.0  None
1  Suresh  25.0   GDP
2      vj  25.0   GDP

In [6]:
# Fill null values with next value.
## Note: It can’t fill null value if last value is null in a column. Because last values don’t have next value.

df = data.fillna(method='bfill')
display(df)

     Name   Age Addr
0    Rama  26.0  GDP
1  Suresh  25.0  GDP
2      vj   NaN  GDP

In [7]:
# Filling null values in string type of data.  
df = data.fillna("no value")
display(df)

     Name       Age      Addr
0    Rama      26.0  no value
1  Suresh      25.0       GDP
2      vj  no value       GDP

In [8]:
# Dropping rows if any row has latest one null value. 
df = data.dropna()
display(df)

     Name   Age Addr
1  Suresh  25.0  GDP

In [9]:
# Dropping rows if all column values are null.
df = data.dropna(how = 'all')
display(df)

     Name   Age  Addr
0    Rama  26.0  None
1  Suresh  25.0   GDP
2      vj   NaN   GDP

In [10]:
# Dropping columns if any column has latest one null value.  
df = data.dropna(axis=1)
display(df)

     Name
0    Rama
1  Suresh
2      vj

In [11]:
df = data.dropna(how = 'all', axis=1)
display(df)

     Name   Age  Addr
0    Rama  26.0  None
1  Suresh  25.0   GDP
2      vj   NaN   GDP